# DS-SF-34 | 03 | Databases, Scrapping, and APIs | Assignment | Starter Code

## The Bistro Meets `SQLite`

In this assignment, we will be exploring the `bistro` dataset.  The previous assignment used `pandas`.  Today, we'll answer the same questions but using `SQLite`.  In some situations, `pandas` will be a better solution.  In others, doing it using `SQL` will make more sense.  As you gain more experience, you'll know which one to use.

> ### Question 1.  Import the `sqlite3` package.

In [2]:
import os

import pandas as pd
pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

import sqlite3
# TODO

> ### Question 2.  Connect to the `dataset-03-bistro.db` database.  The rest of this assignment focus on the `bistro` table.

In [3]:
db = sqlite3.connect(os.path.join('..','datasets','dataset-03-bistro.db'))

> ### Question 3.  How many samples (i.e., rows) are in this dataset?

In [4]:
pd.io.sql.read_sql(
'''
SELECT COUNT(*)
    FROM bistro
;
''', con = db)

   COUNT(*)
0       244

El codigo de arriba te cuanta las filas que tiene a base

> ### Question 4.  Print the first two rows of the table to the console.

In [5]:
pd.io.sql.read_sql(
'''
SELECT *
    FROM bistro
    LIMIT 2
;
''', con = db)

   index     day    time      name  gender  is_smoker  party  check   tip
0      0  Sunday  Dinner  Kimberly  Female          0      2  16.99  1.01
1      1  Sunday  Dinner  Nicholas    Male          0      3  10.34  1.66

> ### Question 5.  For which week days does the dataset has data for?

In [6]:
pd.io.sql.read_sql(
'''
SELECT DISTINCT day
    FROM bistro
;
''', con = db)

        day
0    Sunday
1  Saturday
2  Thursday
3    Friday

Answer: TODO

> ### Question 6.  How often was the bistro patronized for each week day?

In [7]:
pd.io.sql.read_sql(
'''
SELECT day, COUNT(*)
    FROM bistro
    GROUP BY day
;
''', con = db)

        day  COUNT(*)
0    Friday        19
1  Saturday        87
2    Sunday        76
3  Thursday        62

Answer: TODO

> ### Question 7.  How much tip did waiters collect for each week day?

In [8]:
pd.io.sql.read_sql(
'''
SELECT day, SUM(tip) AS total_tip
    FROM bistro
    GROUP BY day
;
''', con = db)

        day  total_tip
0    Friday      51.96
1  Saturday     260.40
2    Sunday     247.39
3  Thursday     171.83

Answer: TODO

> ### Question 8.  What is the average tip per check (in absolute \$) for each week day?

In [9]:
pd.io.sql.read_sql(
'''
SELECT day, AVG(tip) AS mean_tip
    FROM bistro
    GROUP BY day
;
''', con = db)

        day  mean_tip
0    Friday  2.734737
1  Saturday  2.993103
2    Sunday  3.255132
3  Thursday  2.771452

Answer: TODO

> ### Question 9.  What is the average tip per check (as a percentage of the check) for each week day?

(`CHECK` is a reserved keywork; use `` `check` `` (put the name between backticks) to reference the `check` column)

In [10]:
pd.io.sql.read_sql(
'''
SELECT day, SUM(tip) / SUM(`check`) AS percentage_tip
    FROM bistro   
    GROUP BY day
;
''', con = db)

        day  percentage_tip
0    Friday        0.159445
1  Saturday        0.146424
2    Sunday        0.152038
3  Thursday        0.156732

Answer: TODO

> ### Question 10.  Are there any name in common between male and female patrons?  (E.g., `Chris` can refer to either a man or a woman)

(check `numpy.intersect1d()`; it could come in handy)

(https://docs.scipy.org/doc/numpy/reference/generated/numpy.intersect1d.html)

In [11]:
pd.io.sql.read_sql(
'''
SELECT name
    FROM bistro
    WHERE gender = 'Female'
    
INTERSECT   

SELECT name
    FROM bistro
    WHERE gender = 'Male'

;
''', con = db)

    name
0  Casey

Answer: TODO

> ### Question 11.  If no patrons share the same name, how many unique patrons are in the dataset?

In [12]:
pd.io.sql.read_sql(
'''
SELECT DISTINCT name
    FROM bistro
    WHERE name <> 'Casey'    
;
''', con = db)

         name
0    Kimberly
1    Nicholas
2       Larry
3      Joseph
4      Janice
..        ...
175    Darwin
176     Henry
177    Jeremy
178   Dorothy
179    Sandra

[180 rows x 1 columns]

Answer: TODO

> ### Question 12.  How many times did `Kevin` patronized the bistro?  How about `Alice`?

In [48]:
pd.io.sql.read_sql(
'''
WITH frequency_table AS(
  SELECT name, COUNT(name) AS frequency
     FROM Bistro
     GROUP BY name
)

Select name, frequency
   FROM frequency_table
   WHERE name = 'Kevin' OR name = 'Alice'
;
''', con = db)

    name  frequency
0  Alice          2
1  Kevin          4

Answer: TODO

> ### Question 13.  Who are the top 3 female and male patrons?

In [64]:
pd.io.sql.read_sql(
'''
SELECT name, COUNT(name) AS frequency
    FROM Bistro
    WHERE gender = 'Male'
    GROUP BY name
    ORDER BY frequency DESC
    LIMIT 3

UNION 

SELECT name, COUNT(name) AS frequency
    FROM Bistro
    WHERE gender = 'Female'
    GROUP BY name
    ORDER BY frequency DESC
    LIMIT 3  
;
''', con = db)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 0))

DatabaseError: Execution failed on sql '
SELECT name, COUNT(name) AS frequency
    FROM Bistro
    WHERE gender = 'Male'
    GROUP BY name
    ORDER BY frequency DESC
    LIMIT 3

UNION

SELECT name, COUNT(name) AS frequency
    FROM Bistro
    WHERE gender = 'Female'
    GROUP BY name
    ORDER BY frequency DESC
    LIMIT 3
;
': ORDER BY clause should come after UNION not before

Answer: TODO

> ### Question 14.  Who's the best tipper (as a fraction of all tips over all check totals)?  Who's the worst?  How many times did they patronize the bistro?

In [15]:
# TODO

Answer: TODO